Revit 2020 API
BuiltInFailures.ElectricalFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.ElectricalFailures type exposes the following members.
Properties
Name | Description
AllSlotsOnPanelOccupied
 All slots on panel: [Panel Name] are occupied. Some circuits will be disconnected from this panel.
BankDistanceSmallerThanDiameter
 The distance value is smaller than the conduit diameter, please enter a larger value
CableTrayModified
 The cable tray has been modified to be in the opposite direction or insufficient space to create the required fittings.
CannotAssignSecondaryDistSysToCircuit
 Cannot assign or add [Element] to Circuit. There is no assigned secondary distribution system for [Element].
CannotConnectDifferentDesignOptsObjects
 Cannot add or assign [Element] to circuit. Electrical objects belonging to different design options cannot be connected.
CannotCreatePanelScheduleDuetoNoDefaultTemplate
 A panel schedule cannot be created for these panels. A default panel schedule template must be assigned for this template type.
CannotRemoveMembersInCircuitHavingParent
 You have selected elements that are connected to a Panel object in a Circuit. These elements cannot be removed from the Circuit.
CircuitOverload
 Total connected load for Circuit [Name] is exceeding 80% of the defined rating ([Rating Value]).
ConduitModified
 The conduit has been modified to be in the opposite direction or insufficient space to create the required fittings.
ElementsBelongToOtherCircuit
 You have selected elements that are already part of other Circuits that have assigned Panels. The elements you selected cannot be added to this Circuit.
FamilyMismatchCircuit
 The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?
FeedThroughLugsIsDisabled
 The feed through lugs option is unchecked.
FeedThroughLugsIsNotEnabledAndBindGlobalParam
 Can't change connection type to Feed Through Lugs because Feed Through Lugs is not enabled. Enable Feed Through Lugs by enabling the global parameter that Feed Through Lugs is mapping. Click Manage tab -> Settings panel -> Global Parameters.
FeedThroughLugsIsOccupied
 The feed through lugs is in use by circuit [Element].
FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits
 The feed through lugs is occupied, so other circuits connected with feed through lugs will be disconnected from this panel [Panel Name].
InvalidNumwiresSinglephase
 Invalid number of wires for single phase, only 2 and 3 are valid.
InvalidPathOfParallelConduits
 Invalid path of parallel conduits
MismatchConnectorDistSysToCircuit
 Cannot add [Element] to Circuit. The Type for the available connector does not match the Type ([Name]) for the Circuit.
MismatchNmbAssignedDistSysToCircuit
 Cannot assign or add [Element] to Circuit. There is no assigned distribution system for [Element].
MismatchNmbOfPolesToCircuit
 Cannot add [Element] to Circuit. The Number of Poles for [Element] does not match the Number of Poles ([Name]) for the Circuit.
MismatchPoleBrakesSlotsNumbers
 The number of pole breakers may not be less than the number of occupied slots.
MismatchVoltageLineToLine
 Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Line Voltage for [Element] (The Line to Line Voltage is specified in the assigned Distribution System).
MismatchVoltageToCircuit
 Cannot add [Element] to Circuit. The Voltage for [Element] is out of range for the Voltage ([Voltage Value]) for the Circuit.
MissingOrInvalidWireSizeTable
 Wire Size Table "[Fail Name]" is missing or invalid. Use Electrical Settings to select a valid Wire Size Table.
NoAvailableMatchingConnector
 Cannot add [Element] to Circuit. There is no available connector matching the Type ([Type Name]) for the Circuit.
NotAllowedCableTrayConduitRotation
 Don't allow to rotate a horizontal cable tray/conduit like this
NotEnoughAvailSlotsAndLugsOnPanel
 You can't connect to panel [Panel Name] because there aren't enough slots and Feed Through Lugs is occupied. \nYou can increase the maximum number of breaker slots to be greater than [Number] to connect through breaker slots or you can disconnect existing Feed Through Lugs connection.
NotEnoughAvailSlotsOnPanel
 You can't change the connection type to Breakers connect to panel [Panel Name] because there aren't enough slots. \nYou can increase the maximum number of breaker slots to be greater than [Number] to connect through breaker slots or open the panel schedule and manually reshuffle non - consecutive slots.
NotEnoughRoomForParallelConduits
 Due to changes in elevation, there is not enough room to generate all of the parallel conduits. As a result, some conduit segments have not been generated.
NotEnoughRoomForParallelPipes
 Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.
NotPositiveBendRadius
 The value you entered for the bend radius is zero or a negative value. Enter a positive value.
NotSupportConcentricBend
 Conduit with Fittings do not support Concentric Bend Radius, the bend radius of the conduit fittings will be same.
ObjsDemolished
 Cannot assign [Element] to circuit. Objects that are demolished cannot be added to a circuit.
PanelMismatchCircuitType
 Cannot assign [Element] to Circuit. The Type for the panel does not match the Type ([Name]) for the Circuit.
SelectedElementsArePartOfOtherCircuit
 You have selected elements that are already part of other Circuits. They will be removed from the original Circuits and added to this one.
SmallBendRadius
 The value you entered for the bend radius for conduit is too small. Enter a larger value.
UnsignedCircuit
 Circuit is not assigned to a panel
VoltageIsOutOfRange
 Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Ground Voltage for [Element] (The Line to Ground Voltage is specified in the assigned Distribution System)."
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace